#! /usr/bin/python3
# -*- coding: utf-8 -*-

from . import db

filter_year = {
    '2013' : '',
    '2012' : '',
    '2011' : '',
    '2010' : '',
    '00年代': '',
    '90年代': '',
    '80年代': '',
    '更早'  : ''
}

class LiveMenu(db.VideoMenuBase):
    def __init__(self, name):
        super().__init__(name)
        self.cid = 200
        self.filter = {
            '类型': {
                '卫视台':1,
                '地方台':2,
                '央视台':3,
                '境外台':4,
            }
        }

class MovieMenu(db.VideoMenuBase):
    def __init__(self, name):
        super().__init__(name)
        self.cid = 1

        self.filter = {
            '年份' :  filter_year,
            '类型' : {
                '爱情片' : '100100',
                '战争片' : '100101',
                '喜剧片' : '100102',
                '科幻片' : '100103',
                '恐怖片' : '100104',
                '动画片' : '100105',
                '动作片' : '100106',
                '风月片' : '100107',
                '剧情片' : '100108',
                '歌舞片' : '100109',
                '纪录片' : '100110',
                '魔幻片' : '100111',
                '灾难片' : '100112',
                '悬疑片' : '100113',
                '传记片' : '100114',
                '警匪片' : '100116',
                '伦理片' : '100117',
                '惊悚片' : '100118',
                '谍战片' : '100119',
                '历史片' : '100120',
                '武侠片' : '100121',
                '青春片' : '100122',
                '文艺片' : '100123'
            },
            '产地' : {
                '内地'  : '5',
                '香港'  : '27',
                '台湾'  : '28',
                '日本'  : '3',
                '韩国'  : '4',
                # '欧洲' : '2',
                '美国'  : '12',
                '英国'  : '17',
                '法国'  : '18',
                '德国'  : '19',
                '意大利': '20',
                '西班牙': '21',
                '俄罗斯': '24',
                '加拿大': '25',
                '印度'  : '22',
                '泰国'  : '23',
                '其他'  : ''
            }
        }
        self.quickFilter = {
            '热门电影' : {
                    'sort' : '周播放最多'
            },
            '最新电影' :{
                    'sort' : '日播放最多'
            },
            '推荐电影' :{
                    'sort' : '评分最高'
            },
            '国产电影' : {
                    'filter': {
                        '产地' : '内地'
                    },
                    'sort' : '日播放最多'
            },
            '欧美大片' : {
                    'filter': {
                        '产地' : '美国,英国,法国,德国,意大利,西班牙,俄罗斯'
                    },
                    'sort' : '日播放最多'
            },
            '港台电影' : {
                    'filter': {
                        '产地' : '香港,台湾'
                    },
                    'sort' : '日播放最多'
            },
            '日韩电影' : {
                    'filter': {
                        '产地' : '日本,韩国'
                    },
                    'sort' : '日播放最多'
            },
        }


class TVMenu(db.VideoMenuBase):
    def __init__(self, name):
        super().__init__(name)
        self.cid = 2

        self.filter = {
            '年份' : filter_year,
            '类型' : {
                '偶像片'   : '101100',
                '家庭片'   : '101101',
                '历史片'   : '101102',
                '年代片'   : '101103',
                '言情片'   : '101104',
                '武侠片'   : '101105',
                '古装片'   : '101106',
                '都市片'   : '101107',
                '农村片'   : '101108',
                '军旅片'   : '101109',
                '刑侦片'   : '101110',
                '喜剧片'   : '101111',
                '悬疑片'   : '101112',
                '情景片'   : '101113',
                '传记片'   : '101114',
                '科幻片'   : '101115',
                '动画片'   : '101116',
                '动作片'   : '101117',
                '真人秀片' : '101118',
                '栏目片'   : '101119',
                '谍战片'   : '101120',
                '伦理片'   : '101121',
                '战争片'   : '101122',
                '神话片'   : '101123',
                '惊悚片'   : '101124',
            },
            '产地' : {
                '内地' : '5',
                '港剧' : '6',
                '台剧' : '7',
                '美剧' : '9',
                '韩剧' : '8',
                '英剧' : '10',
                '泰剧' : '11',
                '日剧' : '15',
                '其他' : ''
            }
        }
        self.quickFilter = {
            '热播剧' : {
                    'sort' : '周播放最多'
            },
            '最新更新' :{
                    'sort' : '最新发布'
            },
            '推荐' :{
                    'sort' : '评分最高'
            },
            '国内剧' : {
                    'filter': {
                        '产地' : '内地'
                    },
                    'sort' : '日播放最多'
            },
            '日韩剧' : {
                    'filter': {
                        '产地' : '韩剧,日剧'
                    },
                    'sort' : '日播放最多'
            },
            '港台剧' : {
                    'filter': {
                        '产地' : '港剧,台剧'
                    },
                    'sort' : '日播放最多'
            },
            '美剧' : {
                    'filter': {
                        '地区' : '美剧'
                    },
                    'sort' : '日播放最多'
            },
        }

